package bean;

/**
 * Created by 祝文 on 2018/3/21.
 */

public class EsayBaoGaoBean {

    /**
     * work_environment : 三、工作环境分析报告


     你对组织的社会性要求非常高
     你非常喜欢那些经常有外出机会，果断和行动导向的企业文化。你非常希望每天能与许多人接触，愿意积极的建立起广泛的社会关系网，建立起新的商业机会。工作可以直接与客户打交道，如销售人员，商业拓展人员等。自信、有挑战性，发现或创造新的市场机会，有这样工作空间的环境适合你。

     你对组织及对细节的关注度要求非常高
     这表明你非常喜欢有序、组织性、纪律性强的企业文化。这种企业是以取得成绩为驱动力的"getting it right"。在这种高标准、严要求的文化中你会更快乐或者说更容易成功。这种企业往往不断的采用最好的做法，以便它的产品行服务的质量与众不同。你会成为一个行业领先企业中的一员而骄傲。

     你对组织的开放性和想象力要求非常高。
     这表明你适合非常开放、创新的企业文化。你非常喜欢挑战、变化，愿意接受新观点，创新会让你觉得兴奋。你非常喜欢不断尝试新的方法，崇尚与众不同。你喜欢从事有很大风险性的事情。那些鼓励或奖励创新和新思想的企业文化，那些非传统的工作适合你。

     你对组织的合作性和和谐性要求非常高
     这表明你很喜欢那种能培养友好、合作和"温暖"工作氛围的企业文化。办公室对你来说既是一个商业场合也是一个交朋友的地方。你有很强的利他主义情感，并且期望大多数同事有着此种情感或价值观。你倾向于没有冲突和争论，并鼓励相互尊重、支持的企业文化。那种崇尚内部竞争和敢闯敢干的企业肯定不是你成功的地方。

     * standby2 :
     * standby1 :
     * test_introduce :
     MBTI的介绍：
     MBTI人格理论(迈尔斯类型指标,MyersBriggsTypeIndicator,MBTI)——国际最为流行的职业人格评估工具
     人的性格倾向，就象分别使用自己的两只手写字一样，都可以写出来，但惯用的那只写出的会比另一只更好。MBTI是根据荣格的心理类型理论著成，目前已经成为权威的性格测试。
     　　MBTI（Myers-BriggsTypeIndicator），一种迫选型、自我报告式的性格评估测试，用以衡量和描述人们在获取信息、作出决策、对待生活等方面的心理活动规律和性格类型。MBTI人格理论的基础是著名心理学家卡尔·荣格先生关于心理类型的划分，后由美国的心理学家KatharineCookBriggs与IsabelBriggsMyers研究并加以发展。KatherineCookBriggs(1875-1968)和她的心理学家女儿IsabelBriggsMyers根据瑞士著名的心理分析学家CarlG.Jung(荣格)的心理类型理论和她们对于人类性格差异的长期观察和研究而著成。经过了长达50多年的研究和发展，MBTI已经成为了当今全球最为著名和权威的性格测试。
     　　这种理论可以帮助解释为什么不同的人对不同的事物感兴趣、善长不同的工作、并且有时不能互相理解。这个工具已经在世界上运用了将近30年的时间，夫妻利用它增进融洽、老师学生利用它提高学习、授课效率，青年人利用它选择职业，组织利用它改善人际关系、团队沟通、组织建设、组织诊断等多个方面。在世界五百强中，有80%的企业有MBTI的应用经验。
     　　MBTI主要应用于职业发展、职业咨询、团队建议、婚姻教育等方面，是目前国际上应用较广的人才甄别工具。
     　　人的性格倾向，就象分别使用自己的两只手写字一样，都可以写出来，但惯用的那只写出的会比另一只更好。每个人都会沿着自己所属的类型发展出个人行为、技巧和态度，而每一种也都存在着自己的潜能和潜在的盲点。本次测试主要探讨各种性格类型与相关职业的匹配程度。
     　　MBTI倾向显示了人与人之间的差异，而这些差异产生于：
     　　–他们把注意力集中在何处，从哪里获得动力（外向、内向）
     　　–他们获取信息的方式（实感、直觉）
     　　–他们做决定的方法（思维、情感）
     　　–他们对外在世界如何取向；通过认知的过程或判断的过程（判断、知觉）

     　用字母代表如下：
     　　精力支配：外向E—内向I
     　　认识世界：实感S—直觉N
     　　判断事物：思维T—情感F
     　　生活态度：判断J—知觉P
     其中两两组合，可以组合成16种人格类型。
     1.知性特质的哲学家型（INFP）
     2.灵性特质的作家型（INFJ）
     3.冒险特质的记者型（ENFP）
     4.理性特质的教育家型（ENFJ）
     5.一板一眼的学者型（INTP）
     6.实事求是的专家型（INTJ）
     7.推陈出新的发明家型（ENTP）
     8.外刚内柔的陆军元帅型（ENTJ）
     9.让人依靠的照顾者型（ISFJ）
     10.按部就班的公务员型（ISTJ）
     11.善于照顾人的主人型（ESFJ）
     12.卓越领导式的大男人型（ESTJ）
     13.浪漫另类的艺术家型（ISFP）
     14.求新求变的冒险家型（ISTP）
     15.引人瞩目的表演者型（ESFP）
     16.魅力四射的挑战者型（ESTP）

     本报告的目的：帮助你开始了解和分析最真实的自己，协助你迈出职业定位和职业规划的第一步，从人格类型的角度描述了个体的适合岗位特质和你的发展建议。

     报告阅读说明：
     　　•本报告对你的人格特点进行了详细描述，它能够帮助你拓展思路，接受更多的可能性，而不是限制你的选择
     　　•报告结果(性格类型)没有“好”与“坏”之分，但不同特点对于不同的工作存在“适合”与“不适合”的区别，从而表现出具体条件下的优、劣势
     　　•你的人格特点由遗传、成长环境和生活经历决定，不要想象去改变它，但是我们可以在了解性格的基础上对某些趋向的补充和平衡，从而优化我们的决策，更有效地发挥潜力
     　　•报告展示了你的性格偏好，而不是你的知识、经验、技巧
     　　•MBTI已有近70年研究和实践的历史

     本分析报告包括：基本分析报告、职业发展分析报告、工作环境分析报告
     * id : 4
     * test_code : ENFJ
     * job_development : 二、
     职业发展分析报告

     你在工作中的优势：



     ·通常具有优秀的交流及表达能力，某些人能够成为出色的演说家

     ·天生的领导才能及凝聚力，鞭策自己做出成绩，达到目的

     ·有条理，有组织能力，有较强的建立合作关系的能力，能够促进和谐，尊重不同意见

     ·兴趣广泛，头脑灵活，渴望推陈出新

     ·善于与别人感情交融，能预见别人的需要，真诚地关怀别人

     ·能统观全局，洞察行为与意识之间的联系

     ·对自己所信仰的事业尽职尽责

     ·有稳定平和的心态

     ·有冲劲和闯劲，不患得患失

     你在工作中的劣势：



     ·不愿意干与自己价值观相冲突的事情

     ·不愿与别人产生分歧或冲突，容易把人际关系理想化

     ·很难在竞争强、气氛紧张的环境下工作，逃避矛盾冲突，疏忽不愉快的事情

     ·对那些没有效率或死脑筋的人没有耐心

     ·在没有收集足够证据前，易于仓促决定，容易因轻率犯错误

     ·易于满足小范围管理，决不放弃控制权

     ·可能过于个人化地对待批评

     ·斗志不足，容易松懈,通常不愿付出过多的努力

     ·在压力和挫折面前不够坚持

     你的岗位特质：
     ·工作环境轻松，可以接触各种各样的人，并与他们建立和维护亲密、互助的关系

     ·工作中可以接触到新观念，探究新方法，尤其那些可以帮助他人改善的方法

     ·有相当的自主权，并承担一定的责任，充分发挥组织和决策能力

     ·可以创造性地解决问题，做出的贡献能够得到别人的赏识和鼓励

     ·工作有较强的变化性，挑战性，允许自己有条不紊地进行规划

     ·工作允许你同时掌控多个项目，但不要过多处理常规和细致的部分

     你适合的职业

     你喜欢与人交往，愿意去理解别人、取悦别人。同样你也喜欢通过写作、广告等方式与外界交流。
     例如：
     人力资源开发/培训/招聘人员、销售经理、小企业经理、市场（拓展）人员等。
     在咨询业你可以帮助别人解决问题、了解自己、挖掘潜力，并且与他人分享自己的价值观，又能够独立的工作。
     例如：
     广告客户经理、公关人员、作家／记者、制片人、网页/杂志编辑等。
     很多有你这种特点的人愿意进入教育界，可以帮助他人成长和发展，或进入服务机构，这样可以有机会为自己和他人提高生活水平。
     例如：
     艺术/营养/健康类教师、社会工作者、志愿者、非营利机构负责人等。
     有些即要求懂技术，又要有很强的交际、交流能力的复合型工作也是你需要考虑的。
     例如：
     就业指导顾问、职业咨询师、ＥＲＰ咨询顾问、财务咨询顾问等。


     你成功的秘决在于：

     适当放慢你的做事速度
     不要事事控制，学会放手某些事情
     客观、理智地对待周围的一切，以免人为的将事情变复杂

     发展建议：

     尽量避免盲目的信任和赞同
     需要正视冲突，并寻找有成效的解决办法
     需要象关注人一样关注任务的细节
     需要仔细倾听外界的反馈信息，变得更加开放
     目前不要考虑在压力大的环境中工作在
     适合的时候，主动承担一些工作对你的发展更有利
     尽量思考成熟后再采取行动，碰到困难时，你需要坚持
     * basic : 一、
     基本分析报告

     测试结果显示您的性格趋向为：
     ENFJ
     <教导型>


     教导型——谆谆善诱地引导他人

     基本描述:
     你善于社交、气宇不凡、易感应、善劝服。你精力旺盛，热情洋溢，能很快理解他人情感的需要、动机和所忧虑的事情，因此能做到与他人高度协调。你把注意力放在帮助他人，鼓励他人进步向上。你是催化剂，能引发出他人的最佳状态。既可以做有号召力的领袖，也可以做忠实的追随者。
     你性情平和，心胸宽阔，且很圆滑，很会促进周边关系的和睦，对于批评和紧张特别敏感。你容易看出他人的发展潜力，并倾力帮助他人发挥潜力，是体贴的助人为乐者。你愿意组织大家参与活动，使大家和睦又感到愉快。
     你是理想主义者，非常看重自己的价值，对自己尊重景仰的人、事业和公司都非常忠诚。有责任感、谨慎、坚持不协，同时对新观点很好奇。若能为人类的利益有所贡献，会感到深受鼓舞。
     你对现实以外的可能性，以及对他人的影响非常感兴趣，容易看出他人的发展潜力和最大的优点，发现别人看不到的意义和联系，并感到自己与万物息息相关，可以井然有序地安排生活和工作。

     可能的盲点:
     你非常理想化，认为世界是自己想象中的那样，不愿意接受与此相抵触的事情，经常忽略理想所需要的现实和细节问题。
     你依照情感行事，很少用逻辑，主要根据个人的价值观进行判断，无视行为所带来的后果，有时会过度陷入别人的情感和问题中。总是避免冲突，有时会不够诚实和公平。试着更多地去关注事情，而不只是人，更有利于你合理地做出决定。
     你有很高的热情，急于迎接新的挑战，有时会做出错误的假设或过于草率的决定。建议你对计划中的细节多加注意，等获取足够多的信息之后再做决策。
     你总想得到表扬，希望自己的才能和贡献得到赏识，你对于批评非常脆弱，容易忧虑，感到内疚，失去自信。当压力很大时，会变得暴燥，慌乱、吹毛求疵。
     */

    private String work_environment;
    private String standby2;
    private String standby1;
    private String test_introduce;
    private int id;
    private String test_code;
    private String job_development;
    private String basic;

    public String getWork_environment() {
        return work_environment;
    }

    public void setWork_environment(String work_environment) {
        this.work_environment = work_environment;
    }

    public String getStandby2() {
        return standby2;
    }

    public void setStandby2(String standby2) {
        this.standby2 = standby2;
    }

    public String getStandby1() {
        return standby1;
    }

    public void setStandby1(String standby1) {
        this.standby1 = standby1;
    }

    public String getTest_introduce() {
        return test_introduce;
    }

    public void setTest_introduce(String test_introduce) {
        this.test_introduce = test_introduce;
    }

    public int getId() {
        return id;
    }

    public void setId(int id) {
        this.id = id;
    }

    public String getTest_code() {
        return test_code;
    }

    public void setTest_code(String test_code) {
        this.test_code = test_code;
    }

    public String getJob_development() {
        return job_development;
    }

    public void setJob_development(String job_development) {
        this.job_development = job_development;
    }

    public String getBasic() {
        return basic;
    }

    public void setBasic(String basic) {
        this.basic = basic;
    }
}
