package bean;

/**
 * Created by 祝文 on 2018/3/20.
 */

public class XGcsBean {

    /**
     * proposal : 现在你对自己的人格类型和动力已经有了一个比较清楚的了解，但这还不够。“如何通过这些信息使你在这份工作上取得更大的成功”，这是关键所在。运用你的能力非常容易，你成功的秘诀在于：
     放慢你匆忙的脚步；适当放弃某些控制权；客观对待周围的一切。
     个人发展建议是我们咨询师多年测评职业咨询和职业生涯规划的心得体会和经验总结，我们意识到以下的建议中有很多是难以完全照办的，但只要你花时间认真思考，一定会对你有极大的帮助和改变：发展建议：
     需要防止盲目的信任和赞同；需要有成效地管理冲突；
     需要像关注人一样关注任务的细节；需要仔细倾听外界的反馈信息。

     * blind : ENFJ型的人具有如此的同情心与关切之心，以至于对一些问题和他人的情感涉入过多。有时他们选择的事业并不值得他们倾注所有的时间和精力。当一些事情完成得不是很好时，他们会觉得不知所措、失望和理想破灭。这会使他们退缩，感到自己不被欣赏。ENFJ型的人需要学会接受自己和他们所关心的人的缺点。他们还需要了解怎样“挑选他们的战场”和怎样保持现实的期望。
     由于他们对和睦友好强烈的渴望，因此ENFJ型的人能够忽视自己的需求和真实的问题。因为回避冲突，所以他们有的维持，一种缺乏诚实和平等的人际关系。ENFJ型的人非常在意别人的情感，以至于当情况涉及批评或伤害感情时，他们能视而不见重要的事实。学会如何接受和处理作为人际关系中必不可少的冲突，对于ENFJ型的。人来说是重要的。
     因为他们满怀热情，急切地开始下一次挑战，所以ENFJ型的人有时会做出错误的臆断或过于急促地做决定，而没有收集到所有重要的事实。他们需要放慢速度，更仔细地注意计划的细节。直到等到知晓所有的信息，他们才能避免犯错误。
     ENFJ型的人对于情感因素关注的程度到了对他们行为的必然结果视而不见的地步。努力关注涉及他们决定的事实而不仅仅是人，这会很有帮助的。ENFJ型的人对于赞扬有着很好的反应，但却很容易被批评所伤害，这些批评使他们很易怒。他们当面受到甚至是最无恶意或动机良好的批评时，反应是激动、感到受伤害或生气。ENFJ型的人的确应该停下来．退后一步，在做出反应前努力客观地了解情况。少一些敏感能够使ENFJ型的人听到一些包括建设性批评的、重要而有帮助的信息。
     ENFJ型的人是如此的理想化，以至于他们习惯于以他们对事物的希望是怎样，便怎样去看待事物。他们易受理想化的人际关系的影响，易于忽视与他们认为相矛盾的事实。ENFJ型的人没有学会面对自己无法认同的事实，结果他们忽视了自己的问题，而不是去寻找解决的方法。一般来说ENFJ型的人需要警觉。
     * advantage : 对于不同的人格类型和不同的动力等极而言，没有“好”与“坏”之分，每一个人都是一个独一无二的个体，都有其特别的优势和劣势，但问题的关键在于如何认识这些优势和劣势,完善自己。我们对于成功的建议是：“取已之长，补已之短”。学会了这一点将会影响到你的成败及你对工作的喜好。你在工作中的优势：
     优秀的交流及表达能力天生的领导才能及凝聚力
     热情奔放，及有较强的寻求合作的能力坚决果断，有组织能力
     渴望推陈出新
     与别人感情交融，能遇见别人的需要，能真诚地关怀别人兴趣广泛，头脑灵活
     能统观全局，能洞察行为与意识之间的联系鞭策自己做出成绩，达到目的
     对自己所信仰的事业尽职尽责
     * job_scene : 致力于使事情变得更有益于他人的同事；人员导向；支持性和社会化；具有和谐精神；鼓励自我表现；固定的；有序的。
     * defect : 将他人理想化；在冲突时只关注无关紧要的问题；
     可能为了人际关系忽视任务，尤其是任务的细节问题；
     在判断决定时，更多地采用个人的主观评判，可能忽视逻辑性和现实性。
     * problem : 每个人都会用自己的方式进行决策，决策通常来自于你的主导功能，并且完全忽视你的第四功能。你的功能运用如下：
     主导功能情感——辅助功能直觉——第三功能感觉——第四功能思维
     人格中的每一种功能对解决问题都具有关键和重要作用，忽视任何一个都将导致做出有缺陷的决定，理想化的问题解决功能流程如下：
     一个好的决策通常来自于四个功能的合理运用。当你尝试去解决问题时，你可以利用上表指导这个过程，但在整个的执行过程是非常困难的，因为每个人都不愿意用他不喜欢的功能去解决问题。就算你有意识地努力运用所有这些功能，你也不可能会在“真实生活”中以这种顺序运用它们。关键是要利用它们提醒自己，完善决策，就算你不按这种方式行事。
     作中选择符合你的主导功能和辅助功能的岗位是非常重要的。第三功能要经过发展锻炼才能合适运用，第四功能可能永远不会在你的职业生涯中起到关键作用，因此你应当避免那种要求长期使用它的工作。
     * contribution : 关注与周围人员的关系；乐于领导和推动促进团队；
     鼓励合作；能够发现他人的价值；具有较强的对新事物的好奇心和洞察力。
     * personality : ENFJ型的人热爱人类。他们认为人和感情关系是最重要的，而且他们很自然地去关心别人。他们以热情的态度对待生命，感受与个人相关的所有事物。由于他们很理想化，按照自己的价值观生活，因此ENFJ型的人对于他们所尊重和敬佩的人、事业和机构非常忠诚。他们精力充沛、满腔热情、富有责任感、勤勤恳恳、锲而不舍。
     ENFJ型的人具有自我批评的自然倾向。然而，因为他们对他人的情感具有责任心，所以ENFJ型的人很少在公共场合批评人。他们敏锐地意识到什么是(或不是)合适的行为。他们彬彬有礼、富有魅力、讨人喜欢、深谙社会。ENFJ型的人具有平和的性格与忍耐力，他们长于外交，擅长在自己的周围激发幽默感。他们是天然的领导者，受人欢迎而有魅力，他们愿意成为出色的传播工作者，常常有利用自己口头表达的天赋。
     ENFJ型的人在自己对一种情况的感受的基础上做决定，而不是这种情况事实上如何。他们对显而易见的事物之外的可能性，以及这些可能性以怎样的方式影响他人感兴趣。ENFJ型的人天生具有条理性，他们喜欢一种有安排的世界，并且希望别人也是如此。即使其他人：正在做决定，他们还是喜欢把问题解决了。
     ENFJ型的人显得富有同情心和理解力，愿意培养和支持他人。他们能很好地理解别人，有责任感和关心他人。由于他们是理想主义者，因此他们通常看到别人身上的优点。
     可能存在的盲点
     ENFJ型的人具有如此的同情心与关切之心，以至于对一些问题和他人的情感涉入过多。有时他们选择的事业并不值得他们倾注所有的时间和精力。当一些事情完成得不是很好时，他们会觉得不知所措、失望和理想破灭。这会使他们退缩，感到自己不被欣赏。ENFJ型的人需要学会接受自己和他们所关心的人的缺点。他们还需要了解怎样“挑选他们的战场”和怎样保持现实的期望。
     由于他们对和睦友好强烈的渴望，因此ENFJ型的人能够忽视自己的需求和真实的问题。因为回避冲突，所以他们有的维持，一种缺乏诚实和平等的人际关系。ENFJ型的人非常在意别人的情感，以至于当情况涉及批评或伤害感情时，他们能视而不见重要的事实。学会如何接受和处理作为人际关系中必不可少的冲突，对于ENFJ型的。人来说是重要的。
     因为他们满怀热情，急切地开始下一次挑战，所以ENFJ型的人有时会做出错误的臆断或过于急促地做决定，而没有收集到所有重要的事实。他们需要放慢速度，更仔细地注意计划的细节。直到等到知晓所有的信息，他们才能避免犯错误。
     ENFJ型的人对于情感因素关注的程度到了对他们行为的必然结果视而不见的地步。努力关注涉及他们决定的事实而不仅仅是人，这会很有帮助的。ENFJ型的人对于赞扬有着很好的反应，但却很容易被批评所伤害，这些批评使他们很易怒。他们当面受到甚至是最无恶意或动机良好的批评时，反应是激动、感到受伤害或生气。ENFJ型的人的确应该停下来．退后一步，在做出反应前努力客观地了解情况。少一些敏感能够使ENFJ型的人听到一些包括建设性批评的、重要而有帮助的信息。
     ENFJ型的人是如此的理想化，以至于他们习惯于以他们对事物的希望是怎样，便怎样去看待事物。他们易受理想化的人际关系的影响，易于忽视与他们认为相矛盾的事实。ENFJ型的人没有学会面对自己无法认同的事实，结果他们忽视了自己的问题，而不是去寻找解决的方法。一般来说ENFJ型的人需要警觉。
     * Inferiority : 下面列出了你工作中可能存在的缺点，这些缺点有的比较明显，有的并不明显或你没有意识到，目的是为了让你“注意”到它们，并考虑产生的原因。缺点有些是天生的，而有些是长时间形成的，因此你不可能在一两天内改变，而是去提醒、思考。注意：其实知道存在的问题就是改变提高中很重要的一步，你会发现你正在慢慢发生变化。您工作中的劣势：
     不愿干预自己价值观相冲突的事容易把人际关系理想化
     很难在竞争强、气氛紧张的环境下工作对那些没效率、或死脑筋的人没有耐心逃避矛盾冲突，易于疏忽不愉快的事在没有收集足够证据前，易于仓促做决定不愿训诫下属易于因轻率犯错误易于满足小范围管理，决不放弃控制权
     * function : 外向与内向是指我们心理能量的作用方向，判断与知觉是我们做事的两种方式。心理学称之为“态度”。感觉与直觉是我们获取信息的方式，思考和情感是做决定的方式，心理学称之为“功能”，功能是人格理论的精髓、核心。
     每一个人在都会用到四种功能，但对功能应用的喜好程度不一样。等级中第一位的称为“主导功能”，第二位的称为“辅助功能”。每个人都需要运用到这两个过程。
     有效地使用你的类型：(ENFJ)

     ENFJ型的人主导功能是情感（关注情感），辅助功能是直觉。他们倾向于：体谅他人感受、了解他人的需要、喜欢和谐的人际关系、易表露情感、喜去说服他人。探求隐含的原因、可能性或事物的整体。ENFJ型的人比较少地使用他们的第三、第四功能--感觉和思维。即使在需要这些功能的场合，他们仍然无法有效使用。
     作为一个ENFJ型的人：如果你过多地关注情感，你可能会表现得不合乎逻辑、不够客观、没有组织系统的思考、不具批判精神全盘接受、感情用事。如果你过多地使用直觉功能，你可能会表现得不注重细节、不注意实际、不耐沉闷、不合逻辑、把握不住现在、骤下断语。
     * id : 4
     * test_code : ENFJ
     * job : 研究发现：职业满足会使你的工作主动性更强，积极性更高，更愿意去工作。以下不是简单的告诉你
     什么样的工作适合你，而是细化的帮你分析工作中的哪些特质对你重要，你还需要从中选出你认为最重要

     的，因为不同经历的人对特质的重要程度要求是不同的。每个岗位的工作内容都在随企业的发展而发展，不是一成不变的，有时候岗位的发展方向需要我们自己去争取。所以找到适合的工作不如找到适合自己发展的岗位更直接。这些特质可以帮助明确如何主动的发展或争取你岗位中的那些特质。
     下面的条目从各个侧面上认证了您怎样才能受到真正的职业满足，看完这些条目之后，我们建议您根据它们对您的重要程序进行排序，排序的时候，回想一下您过去的学习、工作经历以及当前学习环境和工作感受，并思考：“哪一些是令你感到特别满意，有哪些令你极其不高兴”。试着寻找贯穿这些经历的主题。你的岗位特质：作为ENFJ型人，职业满足意味着你做的这些工作：
     1、能让我与我的同事、客户、主顾建立并维持亲密的、互助的人际关系。
     2、允许我对于我所负责的项目中出现的问题自己创造性地解决，同时我的努力能让我有所回报。
     3、能让我看到我的工作有很好的前景，我所作的贡献得到别人的赏识，同时我自身及我的事业能得到发展，我的进步得到同时的鼓励。
     4、能让我成为另一群富有创造精神的人的一员，同时我还很充实，且有成就感。
     5、允许我有足够的时间探求解决问题的创造性方法，然后与支持我，关心我的人分享。
     6、我的工作环境是积极且富有挑战性的，而且在工作中我有权同时操纵多个项目。
     7、在工作中，我能充分发挥我的组织和决策能力，对我自己负责的项目有自主权，并对其承担一定责任。
     8、我的工作变化性很强，且允许我有时间对它有条不紊地进行好规划。
     9、我的工作环境轻松，人们之间没有冲突，也没有相互猜忌。
     10、让我有机会接触新观念，并允许我探究一些新方法，能让别人生活得更美好。
     */

    private String proposal;
    private String blind;
    private String advantage;
    private String job_scene;
    private String defect;
    private String problem;
    private String contribution;
    private String personality;
    private String Inferiority;
    private String function;
    private int id;
    private String test_code;
    private String job;

    public String getProposal() {
        return proposal;
    }

    public void setProposal(String proposal) {
        this.proposal = proposal;
    }

    public String getBlind() {
        return blind;
    }

    public void setBlind(String blind) {
        this.blind = blind;
    }

    public String getAdvantage() {
        return advantage;
    }

    public void setAdvantage(String advantage) {
        this.advantage = advantage;
    }

    public String getJob_scene() {
        return job_scene;
    }

    public void setJob_scene(String job_scene) {
        this.job_scene = job_scene;
    }

    public String getDefect() {
        return defect;
    }

    public void setDefect(String defect) {
        this.defect = defect;
    }

    public String getProblem() {
        return problem;
    }

    public void setProblem(String problem) {
        this.problem = problem;
    }

    public String getContribution() {
        return contribution;
    }

    public void setContribution(String contribution) {
        this.contribution = contribution;
    }

    public String getPersonality() {
        return personality;
    }

    public void setPersonality(String personality) {
        this.personality = personality;
    }

    public String getInferiority() {
        return Inferiority;
    }

    public void setInferiority(String Inferiority) {
        this.Inferiority = Inferiority;
    }

    public String getFunction() {
        return function;
    }

    public void setFunction(String function) {
        this.function = function;
    }

    public int getId() {
        return id;
    }

    public void setId(int id) {
        this.id = id;
    }

    public String getTest_code() {
        return test_code;
    }

    public void setTest_code(String test_code) {
        this.test_code = test_code;
    }

    public String getJob() {
        return job;
    }

    public void setJob(String job) {
        this.job = job;
    }
}
